jyyy3901/GD32_HAL_Compat/Port/gd32_timer_port.c
#include "gd32_hal_port.h"
#include "gd32f403_timer.h"
#include <stddef.h>

typedef struct
{
    uint32_t timer;
    uint8_t channels;
    uint8_t bidirectional;
    uint8_t repetition;
    uint8_t one_pulse;
    uint8_t master_slave;
} TIMER_Capability;

typedef struct
{
    uint32_t timer;
    GD32_HAL_TIMERDMARequest request;
    uint32_t channel;
    uint32_t token;
} TIMER_DMAMap;

static const TIMER_Capability timerCapabilities[] =
{
    {GD32_HAL_TIMER0_ADDRESS, 4U, 1U, 1U, 1U, 1U},
    {GD32_HAL_TIMER1_ADDRESS, 4U, 1U, 0U, 1U, 1U},
    {GD32_HAL_TIMER2_ADDRESS, 4U, 1U, 0U, 1U, 1U},
    {GD32_HAL_TIMER3_ADDRESS, 4U, 1U, 0U, 1U, 1U},
    {GD32_HAL_TIMER4_ADDRESS, 4U, 1U, 0U, 1U, 1U},
    {GD32_HAL_TIMER5_ADDRESS, 0U, 0U, 0U, 1U, 0U},
    {GD32_HAL_TIMER6_ADDRESS, 0U, 0U, 0U, 1U, 0U},
    {GD32_HAL_TIMER7_ADDRESS, 4U, 1U, 1U, 1U, 1U},
    {GD32_HAL_TIMER8_ADDRESS, 2U, 0U, 0U, 1U, 1U},
    {GD32_HAL_TIMER9_ADDRESS, 1U, 0U, 0U, 0U, 0U},
    {GD32_HAL_TIMER10_ADDRESS, 1U, 0U, 0U, 0U, 0U},
    {GD32_HAL_TIMER11_ADDRESS, 2U, 0U, 0U, 1U, 1U},
    {GD32_HAL_TIMER12_ADDRESS, 1U, 0U, 0U, 0U, 0U},
    {GD32_HAL_TIMER13_ADDRESS, 1U, 0U, 0U, 0U, 0U}
};

#define TIMER_DMA_ENTRY(TIMER_VALUE, REQUEST_VALUE, CONTROLLER, CHANNEL, SLOT) \
    {(TIMER_VALUE), (REQUEST_VALUE), \
     GD32_HAL_DMA_CHANNEL_ADDRESS(((CONTROLLER) == 0U) ? GD32_HAL_DMA0_ADDRESS : GD32_HAL_DMA1_ADDRESS, (CHANNEL)), \
     GD32_HAL_DMA_REQUEST_ENCODE((CONTROLLER), (CHANNEL), (SLOT))}

static const TIMER_DMAMap timerDMAMap[] =
{
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 0U, 1U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_CC2, 0U, 2U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 0U, 5U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_CC4, 0U, 3U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 0U, 4U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_TRIGGER, 0U, 3U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER0_ADDRESS, GD32_HAL_TIMER_DMA_COM, 0U, 3U, 5U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 0U, 4U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER_DMA_CC2, 0U, 6U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 0U, 0U, 1U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER_DMA_CC4, 0U, 6U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER1_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 0U, 1U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER2_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 0U, 5U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER2_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 0U, 1U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER2_ADDRESS, GD32_HAL_TIMER_DMA_CC4, 0U, 2U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER2_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 0U, 2U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER3_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 0U, 0U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER3_ADDRESS, GD32_HAL_TIMER_DMA_CC2, 0U, 3U, 6U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER3_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 0U, 4U, 5U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER3_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 0U, 6U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 1U, 4U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_CC2, 1U, 3U, 1U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 1U, 1U, 1U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_CC4, 1U, 0U, 1U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 1U, 1U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER4_ADDRESS, GD32_HAL_TIMER_DMA_TRIGGER, 1U, 0U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER5_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 1U, 2U, 1U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER6_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 1U, 3U, 2U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_CC1, 1U, 2U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_CC2, 1U, 4U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_CC3, 1U, 0U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_CC4, 1U, 1U, 3U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_UPDATE, 1U, 0U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_TRIGGER, 1U, 1U, 4U),
    TIMER_DMA_ENTRY(GD32_HAL_TIMER7_ADDRESS, GD32_HAL_TIMER_DMA_COM, 1U, 1U, 5U)
};

static const TIMER_Capability *TIMER_FindCapability(uint32_t timer)
{
    uint32_t i;
    for (i = 0U; i < (uint32_t)(sizeof(timerCapabilities) / sizeof(timerCapabilities[0])); ++i)
    {
        if (timerCapabilities[i].timer == timer)
        {
            return &timerCapabilities[i];
        }
    }
    return NULL;
}

static uint16_t TIMER_Channel(uint8_t channel)
{
    static const uint16_t channels[] = {TIMER_CH_0, TIMER_CH_1, TIMER_CH_2, TIMER_CH_3};
    return channels[channel];
}

static uint16_t TIMER_OCMode(GD32_HAL_TIMEROCMode mode)
{
    static const uint16_t modes[] =
    {
        TIMER_OC_MODE_TIMING,
        TIMER_OC_MODE_ACTIVE,
        TIMER_OC_MODE_INACTIVE,
        TIMER_OC_MODE_TOGGLE,
        TIMER_OC_MODE_LOW,
        TIMER_OC_MODE_HIGH,
        TIMER_OC_MODE_PWM0,
        TIMER_OC_MODE_PWM1
    };
    return modes[(uint32_t)mode];
}

int GD32_HAL_TIMER_IsInstance(uint32_t timer_address)
{
    return TIMER_FindCapability(timer_address) != NULL;
}

int GD32_HAL_TIMER_IsChannelValid(uint32_t timer_address, uint8_t channel)
{
    const TIMER_Capability *capability = TIMER_FindCapability(timer_address);
    return (capability != NULL) && (channel < capability->channels);
}

int GD32_HAL_TIMER_IsOnePulseCapable(uint32_t timer_address)
{
    const TIMER_Capability *capability = TIMER_FindCapability(timer_address);
    return (capability != NULL) && (capability->one_pulse != 0U);
}

int GD32_HAL_TIMER_IsMasterSlaveCapable(uint32_t timer_address)
{
    const TIMER_Capability *capability = TIMER_FindCapability(timer_address);
    return (capability != NULL) && (capability->master_slave != 0U);
}

int GD32_HAL_TIMER_ConfigureBase(uint32_t timer_address,
                                 const GD32_HAL_TIMERBaseConfig *config)
{
    const TIMER_Capability *capability = TIMER_FindCapability(timer_address);
    timer_parameter_struct parameters;
    static const uint16_t alignments[] =
    {
        TIMER_COUNTER_EDGE,
        TIMER_COUNTER_CENTER_DOWN,
        TIMER_COUNTER_CENTER_UP,
        TIMER_COUNTER_CENTER_BOTH
    };
    uint16_t clock_division;

    if ((capability == NULL) || (config == NULL))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_INVALID_INSTANCE, timer_address);
        return -1;
    }
    if ((config->alignment > GD32_HAL_TIMER_ALIGNMENT_CENTER_BOTH) ||
        (config->direction > GD32_HAL_TIMER_DIRECTION_DOWN) ||
        ((config->clock_division != 1U) && (config->clock_division != 2U) &&
         (config->clock_division != 4U)))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG, timer_address);
        return -1;
    }
    if (((config->alignment != GD32_HAL_TIMER_ALIGNMENT_EDGE) ||
         (config->direction != GD32_HAL_TIMER_DIRECTION_UP)) &&
        (capability->bidirectional == 0U))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_COUNTER_MODE_UNSUPPORTED,
                           timer_address);
        return -1;
    }
    if ((config->repetition != 0U) && (capability->repetition == 0U))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_REPETITION_UNSUPPORTED,
                           timer_address);
        return -1;
    }

    clock_division = (config->clock_division == 1U) ? TIMER_CKDIV_DIV1 :
                     (config->clock_division == 2U) ? TIMER_CKDIV_DIV2 :
                                                      TIMER_CKDIV_DIV4;
    timer_struct_para_init(&parameters);
    parameters.prescaler = config->prescaler;
    parameters.alignedmode = alignments[(uint32_t)config->alignment];
    parameters.counterdirection = (config->direction == GD32_HAL_TIMER_DIRECTION_DOWN) ?
                                  TIMER_COUNTER_DOWN : TIMER_COUNTER_UP;
    parameters.clockdivision = clock_division;
    parameters.period = config->period;
    parameters.repetitioncounter = config->repetition;
    timer_update_source_config(timer_address, TIMER_UPDATE_SRC_REGULAR);
    timer_init(timer_address, &parameters);
    if (config->auto_reload_preload != 0U)
    {
        timer_auto_reload_shadow_enable(timer_address);
    }
    else
    {
        timer_auto_reload_shadow_disable(timer_address);
    }
    timer_flag_clear(timer_address, TIMER_FLAG_UP);
    return 0;
}

void GD32_HAL_TIMER_DeInit(uint32_t timer_address)
{
    if (GD32_HAL_TIMER_IsInstance(timer_address) != 0)
    {
        timer_deinit(timer_address);
    }
}

void GD32_HAL_TIMER_Enable(uint32_t timer_address)
{
    if (GD32_HAL_TIMER_IsInstance(timer_address) != 0)
    {
        timer_enable(timer_address);
    }
}

void GD32_HAL_TIMER_Disable(uint32_t timer_address)
{
    if (GD32_HAL_TIMER_IsInstance(timer_address) != 0)
    {
        timer_disable(timer_address);
    }
}

void GD32_HAL_TIMER_DisableIfIdle(uint32_t timer_address)
{
    if ((GD32_HAL_TIMER_IsInstance(timer_address) != 0) &&
        ((TIMER_CHCTL2(timer_address) &
          (TIMER_CHCTL2_CH0EN | TIMER_CHCTL2_CH1EN |
           TIMER_CHCTL2_CH2EN | TIMER_CHCTL2_CH3EN)) == 0U))
    {
        timer_disable(timer_address);
    }
}

