jyyy3901/GD32_HAL_Compat/Port/gd32_timer_port.c
int GD32_HAL_TIMER_IsEnabled(uint32_t timer_address)
{
    return (GD32_HAL_TIMER_IsInstance(timer_address) != 0) &&
           ((TIMER_CTL0(timer_address) & TIMER_CTL0_CEN) != 0U);
}

int GD32_HAL_TIMER_IsTriggerSlaveMode(uint32_t timer_address)
{
    return (GD32_HAL_TIMER_IsMasterSlaveCapable(timer_address) != 0) &&
           ((TIMER_SMCFG(timer_address) & TIMER_SMCFG_SMC) ==
            TIMER_SLAVE_MODE_EVENT);
}

void GD32_HAL_TIMER_SetInternalClock(uint32_t timer_address)
{
    if (GD32_HAL_TIMER_IsInstance(timer_address) != 0)
    {
        timer_internal_clock_config(timer_address);
    }
}

int GD32_HAL_TIMER_ConfigureOutput(uint32_t timer_address,
                                   uint8_t channel,
                                   const GD32_HAL_TIMEROCConfig *config)
{
    timer_oc_parameter_struct output;
    uint16_t native_channel;

    if ((config == NULL) ||
        (config->mode > GD32_HAL_TIMER_OC_PWM2) ||
        (config->polarity > GD32_HAL_TIMER_POLARITY_FALLING_LOW) ||
        (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
                           timer_address | channel);
        return -1;
    }

    native_channel = TIMER_Channel(channel);
    timer_channel_output_struct_para_init(&output);
    output.outputstate = TIMER_CCX_DISABLE;
    output.outputnstate = TIMER_CCXN_DISABLE;
    output.ocpolarity = (config->polarity == GD32_HAL_TIMER_POLARITY_FALLING_LOW) ?
                        TIMER_OC_POLARITY_LOW : TIMER_OC_POLARITY_HIGH;
    output.ocnpolarity = TIMER_OCN_POLARITY_HIGH;
    output.ocidlestate = (config->idle_high != 0U) ?
                         TIMER_OC_IDLE_STATE_HIGH : TIMER_OC_IDLE_STATE_LOW;
    output.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    timer_channel_output_config(timer_address, native_channel, &output);
    timer_channel_output_mode_config(timer_address,
                                     native_channel,
                                     TIMER_OCMode(config->mode));
    timer_channel_output_pulse_value_config(timer_address,
                                            native_channel,
                                            config->pulse);
    timer_channel_output_fast_config(timer_address,
                                     native_channel,
                                     (config->fast != 0U) ?
                                     TIMER_OC_FAST_ENABLE : TIMER_OC_FAST_DISABLE);
    timer_channel_output_shadow_config(timer_address,
                                       native_channel,
                                       (config->preload != 0U) ?
                                       TIMER_OC_SHADOW_ENABLE : TIMER_OC_SHADOW_DISABLE);
    return 0;
}

int GD32_HAL_TIMER_ConfigureInput(uint32_t timer_address,
                                  uint8_t channel,
                                  const GD32_HAL_TIMERICConfig *config)
{
    timer_ic_parameter_struct input;
    uint16_t native_channel;
    static const uint16_t selections[] =
    {
        TIMER_IC_SELECTION_DIRECTTI,
        TIMER_IC_SELECTION_INDIRECTTI,
        TIMER_IC_SELECTION_ITS
    };
    static const uint16_t prescalers[] =
    {
        TIMER_IC_PSC_DIV1,
        TIMER_IC_PSC_DIV2,
        TIMER_IC_PSC_DIV4,
        TIMER_IC_PSC_DIV8
    };

    if ((config == NULL) ||
        (config->selection > GD32_HAL_TIMER_IC_TRIGGER) ||
        (config->polarity > GD32_HAL_TIMER_POLARITY_BOTH) ||
        (config->prescaler > 3U) || (config->filter > 15U) ||
        ((channel == 3U) && (config->polarity == GD32_HAL_TIMER_POLARITY_BOTH)) ||
        (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
                           timer_address | channel);
        return -1;
    }

    native_channel = TIMER_Channel(channel);
    timer_channel_input_struct_para_init(&input);
    input.icpolarity = (config->polarity == GD32_HAL_TIMER_POLARITY_RISING_HIGH) ?
                       TIMER_IC_POLARITY_RISING :
                       (config->polarity == GD32_HAL_TIMER_POLARITY_FALLING_LOW) ?
                       TIMER_IC_POLARITY_FALLING :
                       (uint16_t)(TIMER_IC_POLARITY_FALLING | 0x0008U);
    input.icselection = selections[(uint32_t)config->selection];
    input.icprescaler = prescalers[config->prescaler];
    input.icfilter = config->filter;
    timer_input_capture_config(timer_address, native_channel, &input);
    timer_channel_output_state_config(timer_address, native_channel, TIMER_CCX_DISABLE);
    return 0;
}

void GD32_HAL_TIMER_SetChannel(uint32_t timer_address, uint8_t channel, int enable)
{
    if (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
                           timer_address | channel);
        return;
    }
    timer_channel_output_state_config(timer_address,
                                      TIMER_Channel(channel),
                                      (enable != 0) ? TIMER_CCX_ENABLE : TIMER_CCX_DISABLE);
    if ((enable != 0) &&
        (GD32_HAL_TIMER_IsChannelInput(timer_address, channel) == 0) &&
        ((timer_address == GD32_HAL_TIMER0_ADDRESS) ||
         (timer_address == GD32_HAL_TIMER7_ADDRESS)))
    {
        timer_primary_output_config(timer_address, ENABLE);
    }
}

int GD32_HAL_TIMER_IsChannelInput(uint32_t timer_address, uint8_t channel)
{
    if (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0)
    {
        return 0;
    }
    if (channel == 0U) { return (TIMER_CHCTL0(timer_address) & TIMER_CHCTL0_CH0MS) != 0U; }
    if (channel == 1U) { return (TIMER_CHCTL0(timer_address) & TIMER_CHCTL0_CH1MS) != 0U; }
    if (channel == 2U) { return (TIMER_CHCTL1(timer_address) & TIMER_CHCTL1_CH2MS) != 0U; }
    return (TIMER_CHCTL1(timer_address) & TIMER_CHCTL1_CH3MS) != 0U;
}

void GD32_HAL_TIMER_SetOnePulse(uint32_t timer_address, int single)
{
    if (GD32_HAL_TIMER_IsOnePulseCapable(timer_address) == 0)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG, timer_address);
        return;
    }
    timer_single_pulse_mode_config(timer_address,
                                   (single != 0) ?
                                   TIMER_SP_MODE_SINGLE : TIMER_SP_MODE_REPETITIVE);
}

int GD32_HAL_TIMER_ConfigureMaster(uint32_t timer_address,
                                   uint8_t trigger_output,
                                   int master_slave_enable)
{
    static const uint32_t outputs[] =
    {
        TIMER_TRI_OUT_SRC_RESET,
        TIMER_TRI_OUT_SRC_ENABLE,
        TIMER_TRI_OUT_SRC_UPDATE,
        TIMER_TRI_OUT_SRC_CH0,
        TIMER_TRI_OUT_SRC_O0CPRE,
        TIMER_TRI_OUT_SRC_O1CPRE,
        TIMER_TRI_OUT_SRC_O2CPRE,
        TIMER_TRI_OUT_SRC_O3CPRE
    };

    if ((trigger_output > 7U) ||
        (GD32_HAL_TIMER_IsMasterSlaveCapable(timer_address) == 0))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_MASTER_SLAVE_UNSUPPORTED,
                           timer_address);
        return -1;
    }
    timer_master_output_trigger_source_select(timer_address, outputs[trigger_output]);
    timer_master_slave_mode_config(timer_address,
                                   (master_slave_enable != 0) ?
                                   TIMER_MASTER_SLAVE_MODE_ENABLE :
                                   TIMER_MASTER_SLAVE_MODE_DISABLE);
    return 0;
}

int GD32_HAL_TIMER_ConfigureSlave(uint32_t timer_address,
                                  const GD32_HAL_TIMERSlaveConfig *config)
{
    static const uint32_t slave_modes[] =
    {
        TIMER_SLAVE_MODE_DISABLE,
        TIMER_SLAVE_MODE_RESTART,
        TIMER_SLAVE_MODE_PAUSE,
        TIMER_SLAVE_MODE_EVENT,
        TIMER_SLAVE_MODE_EXTERNAL0
    };
    static const uint32_t trigger_sources[] =
    {
        TIMER_SMCFG_TRGSEL_ITI0,
        TIMER_SMCFG_TRGSEL_ITI1,
        TIMER_SMCFG_TRGSEL_ITI2,
        TIMER_SMCFG_TRGSEL_ITI3,
        TIMER_SMCFG_TRGSEL_CI0F_ED,
        TIMER_SMCFG_TRGSEL_CI0FE0,
        TIMER_SMCFG_TRGSEL_CI1FE1,
        TIMER_SMCFG_TRGSEL_ETIFP
    };
    static const uint32_t external_prescalers[] =
    {
        TIMER_EXT_TRI_PSC_OFF,
        TIMER_EXT_TRI_PSC_DIV2,
        TIMER_EXT_TRI_PSC_DIV4,
        TIMER_EXT_TRI_PSC_DIV8
    };
    uint8_t trigger = config != NULL ? config->input_trigger : 0U;

    if ((config == NULL) || (config->slave_mode > 4U) ||
        (trigger > 7U) || (config->trigger_prescaler > 3U) ||
        (config->trigger_filter > 15U) ||
        (GD32_HAL_TIMER_IsMasterSlaveCapable(timer_address) == 0))
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_MASTER_SLAVE_UNSUPPORTED,
                           timer_address);
        return -1;
    }

    if (trigger < 4U)
    {
        uint8_t gd_index;
        if ((config->trigger_polarity != GD32_HAL_TIMER_POLARITY_RISING_HIGH) ||
            (config->trigger_prescaler != 0U) ||
            (config->trigger_filter != 0U))
        {
            GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG,
                               timer_address | trigger);
            return -1;
        }
        if (STM32_TIMER_TriggerToGD32ITI(config->stm32_timer_instance,
                                         trigger,
                                         &gd_index) == 0)
        {
            GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_ITR_UNMAPPABLE,
                               timer_address | trigger);
            return -1;
        }
        trigger = gd_index;
    }
    else if (trigger < 7U)
    {
        GD32_HAL_TIMERICConfig input;
        const uint8_t channel = (trigger == 6U) ? 1U : 0U;
        if (config->trigger_prescaler != 0U)
        {
            GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG,
                               timer_address | config->trigger_prescaler);
            return -1;
        }
        input.polarity = config->trigger_polarity;
        input.selection = GD32_HAL_TIMER_IC_DIRECT;
        input.prescaler = 0U;
        input.filter = config->trigger_filter;
        if (GD32_HAL_TIMER_ConfigureInput(timer_address, channel, &input) != 0)
        {
            return -1;
        }
    }
    else if (trigger == 7U)
    {
        if ((timer_address != GD32_HAL_TIMER0_ADDRESS) &&
            (timer_address != GD32_HAL_TIMER1_ADDRESS) &&
            (timer_address != GD32_HAL_TIMER2_ADDRESS) &&
            (timer_address != GD32_HAL_TIMER3_ADDRESS) &&
            (timer_address != GD32_HAL_TIMER4_ADDRESS) &&
            (timer_address != GD32_HAL_TIMER7_ADDRESS))
        {
            GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_MASTER_SLAVE_UNSUPPORTED,
                               timer_address);
            return -1;
        }
        if (config->trigger_polarity == GD32_HAL_TIMER_POLARITY_BOTH)
        {
            GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG,
                               timer_address);
            return -1;
        }
        timer_external_trigger_config(
            timer_address,
            external_prescalers[config->trigger_prescaler],
            (config->trigger_polarity == GD32_HAL_TIMER_POLARITY_FALLING_LOW) ?
            TIMER_ETP_FALLING : TIMER_ETP_RISING,
            config->trigger_filter);
    }

    timer_input_trigger_source_select(timer_address, trigger_sources[trigger]);
    timer_slave_mode_select(timer_address, slave_modes[config->slave_mode]);
    return 0;
}

