jyyy3901/GD32_HAL_Compat/Port/gd32_timer_port.c
void GD32_HAL_TIMER_SetInterrupt(uint32_t timer_address,
                                 uint32_t interrupts,
                                 int enable)
{
    if (enable != 0)
    {
        timer_interrupt_enable(timer_address, interrupts & 0xFFU);
    }
    else
    {
        timer_interrupt_disable(timer_address, interrupts & 0xFFU);
    }
}

uint32_t GD32_HAL_TIMER_GetInterrupts(uint32_t timer_address)
{
    return TIMER_DMAINTEN(timer_address) & 0xFFU;
}

uint32_t GD32_HAL_TIMER_GetFlag(uint32_t timer_address, uint32_t flags)
{
    return TIMER_INTF(timer_address) & flags;
}

void GD32_HAL_TIMER_ClearFlag(uint32_t timer_address, uint32_t flags)
{
    timer_flag_clear(timer_address, flags);
}

void GD32_HAL_TIMER_SetDMARequest(uint32_t timer_address,
                                  GD32_HAL_TIMERDMARequest request,
                                  int enable)
{
    const uint16_t source = (uint16_t)(1U << (uint32_t)request);
    if (enable != 0)
    {
        timer_dma_enable(timer_address, source);
    }
    else
    {
        timer_dma_disable(timer_address, source);
    }
}

int GD32_HAL_TIMER_IsDMAChannelValid(uint32_t timer_address,
                                     GD32_HAL_TIMERDMARequest request,
                                     uint32_t channel_address,
                                     uint32_t request_token)
{
    uint32_t i;
    for (i = 0U; i < (uint32_t)(sizeof(timerDMAMap) / sizeof(timerDMAMap[0])); ++i)
    {
        if ((timerDMAMap[i].timer == timer_address) &&
            (timerDMAMap[i].request == request) &&
            (timerDMAMap[i].channel == channel_address) &&
            (timerDMAMap[i].token == request_token))
        {
            return 1;
        }
    }
    return 0;
}

uint32_t GD32_HAL_TIMER_GetDMADataAddress(uint32_t timer_address,
                                          GD32_HAL_TIMERDMARequest request)
{
    if (request == GD32_HAL_TIMER_DMA_UPDATE)
    {
        return timer_address + 0x2CU;
    }
    if ((request >= GD32_HAL_TIMER_DMA_CC1) &&
        (request <= GD32_HAL_TIMER_DMA_CC4))
    {
        return timer_address + 0x34U +
               (4U * ((uint32_t)request - (uint32_t)GD32_HAL_TIMER_DMA_CC1));
    }
    GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED,
                       timer_address | (uint32_t)request);
    return 0U;
}

void GD32_HAL_TIMER_SetCounter(uint32_t timer_address, uint32_t value)
{
    if (value > 0xFFFFU)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE, value);
        return;
    }
    timer_counter_value_config(timer_address, (uint16_t)value);
}

uint32_t GD32_HAL_TIMER_GetCounter(uint32_t timer_address)
{
    return timer_counter_read(timer_address) & 0xFFFFU;
}

void GD32_HAL_TIMER_SetAutoReload(uint32_t timer_address, uint32_t value)
{
    if (value > 0xFFFFU)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE, value);
        return;
    }
    timer_autoreload_value_config(timer_address, (uint16_t)value);
}

uint32_t GD32_HAL_TIMER_GetAutoReload(uint32_t timer_address)
{
    return TIMER_CAR(timer_address) & 0xFFFFU;
}

void GD32_HAL_TIMER_SetPrescaler(uint32_t timer_address, uint32_t value)
{
    if (value > 0xFFFFU)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE, value);
        return;
    }
    timer_prescaler_config(timer_address, (uint16_t)value, TIMER_PSC_RELOAD_UPDATE);
}

uint32_t GD32_HAL_TIMER_GetPrescaler(uint32_t timer_address)
{
    return TIMER_PSC(timer_address) & 0xFFFFU;
}

void GD32_HAL_TIMER_SetCompare(uint32_t timer_address,
                               uint8_t channel,
                               uint32_t value)
{
    if ((value > 0xFFFFU) ||
        (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0))
    {
        GD32_HAL_ErrorHook((value > 0xFFFFU) ?
                           GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE :
                           GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
                           (value > 0xFFFFU) ? value : (timer_address | channel));
        return;
    }
    timer_channel_output_pulse_value_config(timer_address,
                                            TIMER_Channel(channel),
                                            value);
}

uint32_t GD32_HAL_TIMER_GetCompare(uint32_t timer_address, uint8_t channel)
{
    if (GD32_HAL_TIMER_IsChannelValid(timer_address, channel) == 0)
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
                           timer_address | channel);
        return 0U;
    }
    return timer_channel_capture_value_register_read(timer_address,
                                                      TIMER_Channel(channel)) &
           0xFFFFU;
}
